#### TessellatedFace Members

---

|  |
| --- |
| TessellatedFace Class   Constructors   Methods   Properties   See Also |

The  TessellatedFace  type exposes the following members.

# Constructors

|  | Name | Description |
| --- | --- | --- |
| Public method | TessellatedFace(IList XYZ , ElementId) | Constructs a tessellated face without holes. Face data is always set, even if the input data are invalid (e.g., describes a wildly non-planar face). A TessellatedShepeBuilder's function is used to check the data and heal them if possible. |
| Public method | TessellatedFace(IList IList XYZ , ElementId) | Constructs a tessellated face, which, may be, have holes. Face data is always set, even if the input data are invalid (e.g., describes a wildly non-planar face). A TessellatedShepeBuilder's function is used to check the data and heal them if possible. |

# Methods

|  | Name | Description |
| --- | --- | --- |
| Public method | Dispose | Releases all resources used by the  TessellatedFace |
| Public method | Equals | Determines whether the specified  Object  is equal to the current  Object  . (Inherited from  Object  .) |
| Public method | GetBoundaryLoops | Get loops bounding the face. |
| Public method | GetHashCode | Serves as a hash function for a particular type. (Inherited from  Object  .) |
| Public method | GetType | Gets the  Type  of the current instance. (Inherited from  Object  .) |
| Public method | ToString | Returns a string that represents the current object. (Inherited from  Object  .) |

# Properties

|  | Name | Description |
| --- | --- | --- |
| Public property | IsValidObject | Specifies whether the .NET object represents a valid Revit entity. |
| Public property | MaterialId | Material of the face. |

# See Also

TessellatedFace Class

Autodesk.Revit.DB Namespace